{
  "backend/main.mo": "Motoko actor exposing five shared functions for field measurement calculations: perimeter from wheel rotations, rectangle area, square area, irregular area from triangles, and area from rotations given a shape variant (square or rectangle).",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (full-featured calculator UI, PWA configuration, and agricultural visual theme) to their associated source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON object providing one- to two-sentence summaries for every frontend source file, serving as a quick reference for the purpose and key details of each component, hook, config, and public asset.",
  "frontend/index.css": "Global Tailwind stylesheet defining OKLCH-based CSS custom property color tokens for both light and dark modes, plus base body and border styles.",
  "frontend/index.html": "HTML entry point with PWA meta tags (theme-color, apple-mobile-web-app-capable, viewport-fit=cover), manifest and apple-touch-icon links, and an inline service worker registration script.",
  "frontend/public/manifest.json": "PWA web app manifest for 'SPA Field Measure' with standalone display mode, earthy-green theme color, portrait orientation, and 192×512px icon references.",
  "frontend/public/sw.js": "Service worker that caches the app shell on install, removes stale caches on activate, and uses cache-first for static assets while falling back to network-first for ICP canister API calls.",
  "frontend/src/App.tsx": "Root React component wrapping the app in QueryClientProvider with a sticky earthy-green header, single-column main layout containing FieldCalculator, ConsiderationsPanel, FormulaReference, and UnitConversions sections, plus a footer with caffeine.ai attribution.",
  "frontend/src/components/ConsiderationsPanel.tsx": "Amber-tinted tips panel rendering three measurement considerations (wheel slip, path accuracy, irregular fields) as icon-and-text rows inside a rounded card.",
  "frontend/src/components/FieldCalculator.tsx": "Main calculator component managing shape selection, per-shape form state, input validation, and backend mutation calls, rendering the appropriate input form and ResultsDisplay based on the active shape.",
  "frontend/src/components/FormulaReference.tsx": "Displays a reference card listing common land measurement formulas (perimeter, rectangle/square/irregular area, rotation-based area) with examples.",
  "frontend/src/components/IrregularInputs.tsx": "Renders a dynamic list of triangle inputs (base and height) for calculating irregular field areas, with add/remove functionality and validation error display.",
  "frontend/src/components/PerimeterInputs.tsx": "Form component for entering wheel circumference and rotation count to calculate field perimeter, with validation error display.",
  "frontend/src/components/RectangleInputs.tsx": "Form component for entering rectangle field dimensions (length and width) with validation error display.",
  "frontend/src/components/ResultsDisplay.tsx": "Displays calculated area (in acres, m², and hectares) and perimeter (in meters and kilometers) results in a styled card layout.",
  "frontend/src/components/RotationInputs.tsx": "Form component for calculating field area from wheel rotation data, supporting both square and rectangle shapes with conditional width input.",
  "frontend/src/components/ShapeSelector.tsx": "Grid button selector for choosing the field shape type (rectangle, square, irregular, or rotation count) used to drive the calculator.",
  "frontend/src/components/SquareInputs.tsx": "Simple form component for entering a square field's side length with validation error display.",
  "frontend/src/components/UnitConversions.tsx": "Displays a reference card of common unit conversions between hectares, acres, square meters, and distance units.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using React Query, supporting both authenticated (Internet Identity) and anonymous access, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/clear functions and status flags. Includes an InternetIdentityProvider component that persists identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query mutation hooks that call backend actor methods for calculating perimeter, rectangle area, square area, irregular area, and rotation-based area. Each hook retrieves the actor via useActor and wraps the corresponding canister call.",
  "frontend/src/index.css": "Global stylesheet using Tailwind CSS with an earthy-green agricultural OKLCH color token palette for both light and dark modes. Includes mobile-safe-area padding and minimum touch-target sizing.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH/HSL color tokens, custom font families, border radii, box shadows, and a fade-in animation. Includes tailwindcss-animate, @tailwindcss/typography, and @tailwindcss/container-queries plugins.",
  "project_state.json": "Tracks the project state for a Land Area Calculator app, listing existing features (UI, PWA, theming) and pending feature requests (rotation-based area, unit results, perimeter, and Motoko backend actor). Stores schema version, architectural notes, and clarification settings."
}