{
  "backend/main.mo": "Motoko actor exposing five async calculation methods: perimeter from wheel rotations, rectangle area, square area, irregular area from triangles, and area-from-rotations supporting square or rectangle shapes.",
  "feature_evidence.json": "Feature evidence report mapping four PWA-related features (barn logo icon generation, manifest.json update, index.html update, service worker setup) to their associated files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Auto-generated JSON document containing one-to-two sentence summaries of all frontend source files, serving as a build-planning reference for the project's components, hooks, styles, and PWA assets.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining OKLCH-based design tokens for light and dark modes, including background, foreground, primary, card, chart, and sidebar color variables.",
  "frontend/index.html": "HTML entry point configuring PWA meta tags, barn logo favicon and apple-touch-icon, manifest link, white theme-color, and inline service worker registration script.",
  "frontend/public/manifest.json": "PWA web app manifest for 'SPA For Accurate Measure' specifying standalone display, white colors, and three barn logo icon sizes (180×180, 192×192, 512×512) pointing to generated asset paths.",
  "frontend/public/sw.js": "Service worker using cache-first strategy for static assets (including barn logo icons) and network-first for ICP API calls, with versioned cache 'spa-accurate-measure-v2' and full app-shell precaching on install.",
  "frontend/src/App.tsx": "Root React component wrapping the app in QueryClientProvider with a sticky primary-colored header, main content sections (FieldCalculator, ConsiderationsPanel, FormulaReference, UnitConversions), and a footer with caffeine.ai attribution.",
  "frontend/src/components/ConsiderationsPanel.tsx": "Amber-themed tips panel rendering three measurement considerations (wheel slip, path accuracy, irregular fields) as icon-and-text rows inside a rounded card.",
  "frontend/src/components/FieldCalculator.tsx": "Main calculator component that manages form state for rectangle, square, irregular, rotation, and perimeter calculations, dispatching mutations via React Query hooks and displaying results.",
  "frontend/src/components/FormulaReference.tsx": "Static display component that lists all supported calculation formulas with examples in a styled reference card.",
  "frontend/src/components/IrregularInputs.tsx": "Form component for irregular field area calculation that allows adding/removing triangles, each with base and height inputs.",
  "frontend/src/components/PerimeterInputs.tsx": "Form component with two inputs—wheel circumference and rotation count—for calculating field perimeter.",
  "frontend/src/components/RectangleInputs.tsx": "Form component with length and width inputs for rectangular field area calculation.",
  "frontend/src/components/ResultsDisplay.tsx": "Displays calculated area (in m², acres, and hectares) and perimeter (in meters and kilometers) in a styled results card.",
  "frontend/src/components/RotationInputs.tsx": "Form component for rotation-based area calculation, accepting wheel circumference, rotation count, field shape (square/rectangle), and optional width.",
  "frontend/src/components/ShapeSelector.tsx": "Grid button selector component for choosing between rectangle, square, irregular, and rotation-count field shape modes.",
  "frontend/src/components/SquareInputs.tsx": "Simple form component with a single side-length input for square field area calculation.",
  "frontend/src/components/UnitConversions.tsx": "Static display component showing a reference table of common unit conversions between hectares, acres, meters, and miles.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query mutation hooks for calling backend canister methods: perimeter calculation, rectangle/square/irregular area, and area-from-wheel-rotations.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining an earthy green agricultural color palette via CSS custom properties for both light and dark modes, plus mobile-safe-area and touch-target utilities.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (mapped to CSS variables), fonts, border radii, shadows, and animations, plus animate/typography/container-queries plugins.",
  "project_state.json": "Tracks the project's current state, architectural notes, existing features, and new feature requests for a PWA land area calculator app ('SPA For Accurate Measure') with barn logo icons and offline support."
}